Revit 2016 API
IPipeFittingAndAccessoryPressureDropServer Interface
 Interface class for external servers implementing pipe fitting and pipe accessory coefficient calculation.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public interface IPipeFittingAndAccessoryPressureDropServer : IExternalServer
Visual Basic
Public Interface IPipeFittingAndAccessoryPressureDropServer _
	Inherits IExternalServer
Visual C++
public interface class IPipeFittingAndAccessoryPressureDropServer : IExternalServer
See Also
IPipeFittingAndAccessoryPressureDropServer Members
Autodesk.Revit.DB.Plumbing Namespace